//=====================================================================================================================
// Проект: Модуль платформы Windows
// Раздел: Общая подсистема
// Подраздел: Подсистема работы с реестром
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWindowsRegistryCommon.cs
*		Статический класс для работы с реестром.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup WindowsCommonRegistry Подсистема работы с реестром
         * \ingroup WindowsCommon
         * \brief Подсистема работы с реестром.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для работы с реестром
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XRegistry
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение MimeType типа файла по его расширению
			/// </summary>
			/// <param name="file_name">Имя файла</param>
			/// <returns>Тип MimeType</returns>
			//---------------------------------------------------------------------------------------------------------
			public static String GetMimeType(String file_name)
			{
				String mime_type = "application/unknown";
				String ext = System.IO.Path.GetExtension(file_name).ToLower();
				Microsoft.Win32.RegistryKey regKey = Microsoft.Win32.Registry.ClassesRoot.OpenSubKey(ext);
				if (regKey != null && regKey.GetValue("Content Type") != null)
					mime_type = regKey.GetValue("Content Type").ToString();
				return mime_type;
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================