//=====================================================================================================================
// Проект: Модуль платформы Windows
// Раздел: Подсистема работы с WPF
// Подраздел: Методы расширения
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWindowsFlowDocumentExtension.cs
*		Методы расширения для работы с документами.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Windows.Documents;
//=====================================================================================================================
namespace Lotus
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup WindowsWPFExtension
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширения для типа <see cref="FlowDocument"/>
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XWindowsFlowDocumentExtension
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установить текст для указанного элемента Run
			/// </summary>
			/// <param name="this">Документ</param>
			/// <param name="run_name">Имя элемента Run</param>
			/// <param name="text">Текст</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SetTextForRunName(this FlowDocument @this, String run_name, String text)
			{
				var run = @this.FindName(run_name) as Run;
				if (run != null)
				{
					run.Text = text;
				}
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================