//=====================================================================================================================
// Проект: Модуль платформы Windows
// Раздел: Подсистема работы с WPF
// Подраздел: Элементы интерфейса
// Группа: Общие элементы управления
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusButtonCommandIcon.xaml.cs
*		Стандартная кнопка с поддержкой иконки из связанной команды.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Windows.Controls;
//=====================================================================================================================
namespace Lotus
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		/**
         * \defgroup WindowsWPFControlsCommon Общие элементы управления
         * \ingroup WindowsWPFControls
         * \brief Общие элементы управления.
         * @{
         */
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Стандартная кнопка с поддержкой иконки из связанной команды
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public partial class LotusButtonCommandIcon : Button
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public LotusButtonCommandIcon()
			{
				InitializeComponent();
				SetResourceReference(StyleProperty, typeof(Button));
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================