//=====================================================================================================================
// Проект: Модуль платформы Windows
// Раздел: Подсистема работы с WPF
// Подраздел: Элементы интерфейса
// Группа: Элементы для работы с данными
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusColumnStringFilter.xaml.cs
*		Элемент служащий для формирования элемента запроса для строковых типов данных.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System.ComponentModel;
using System.Windows;
using System.Windows.Controls;
//=====================================================================================================================
namespace Lotus
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup WindowsWPFControlsData
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Элемент служащий для формирования элемента запроса для строковых типов данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public partial class LotusColumnStringFilter : UserControl
		{
			#region ======================================= ОПРЕДЕЛЕНИЕ СВОЙСТВ ЗАВИСИМОСТИ ===========================
			/// <summary>
			/// Элемент запроса для строковых данных
			/// </summary>
			public static readonly DependencyProperty QueryItemProperty = DependencyProperty.Register(nameof(QueryItem),
				typeof(CQueryItemString), typeof(LotusColumnStringFilter),
				new FrameworkPropertyMetadata(null, FrameworkPropertyMetadataOptions.AffectsRender));
			#endregion

			#region ======================================= МЕТОДЫ СВОЙСТВ ЗАВИСИМОСТИ ================================
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Элемент запроса для строковых данных
			/// </summary>
			[Browsable(false)]
			public CQueryItemString QueryItem
			{
				get { return (CQueryItemString)GetValue(QueryItemProperty); }
				set { SetValue(QueryItemProperty, value); }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public LotusColumnStringFilter()
			{
				InitializeComponent();
				QueryItem = new CQueryItemString();
				QueryItem.BindingComboBoxToSearchOption(comboSearchOption);
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================