//=====================================================================================================================
// Проект: Модуль платформы Windows
// Раздел: Общая подсистема
// Подраздел: Подсистема работы с GDI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusWindowsGDIConverters.cs
*		Реализация типовых конвертаций различных типов и структур в данные System.Drawing.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Drawing;
using System.Numerics;
//=====================================================================================================================
namespace Lotus
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup WindowsCommonGDI
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для реализации методов конвертации
		/// </summary>
		/// <remarks>
		/// Используется для некоторых типовых преобразований
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public static class XDrawingConverters
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конвертация списка векторов
			/// </summary>
			/// <param name="values">Список векторов одинарной точности</param>
			/// <returns>Список точек System.Drawing</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Point[] ConvertToDrawingPoints(this IList<Vector2> values)
			{
				Point[] list = new Point[values.Count];
				for (Int32 i = 0; i < values.Count; i++)
				{
					list[i] = new Point((Int32)values[i].X, (Int32)values[i].Y);
				}

				return (list);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конвертация списка векторов
			/// </summary>
			/// <param name="values">Список векторов одинарной точности</param>
			/// <returns>Список точек System.Drawing</returns>
			//---------------------------------------------------------------------------------------------------------
			public static PointF[] ConvertToDrawingPointsF(this IList<Vector2> values)
			{
				PointF[] list = new PointF[values.Count];
				for (Int32 i = 0; i < values.Count; i++)
				{
					list[i] = new PointF(values[i].X, values[i].Y);
				}

				return (list);
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================