//=====================================================================================================================
// Проект: Модуль UI платформы Windows
// Раздел: Элементы интерфейса
// Подраздел: Элементы для ленты
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusRibbonQuickAccessButton.xaml.cs
*		Кнопка ленты быстрого доступа с поддержкой иконки из связанной команды.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.04.2023
//=====================================================================================================================
using System;
using System.Windows;
//---------------------------------------------------------------------------------------------------------------------
using Fluent;
//=====================================================================================================================
namespace Lotus
{
	namespace Windows
	{
		//-------------------------------------------------------------------------------------------------------------
		/** \addtogroup WindowsWPFControlsRibbon
		*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Кнопка ленты быстрого доступа с поддержкой иконки из связанной команды
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public partial class LotusRibbonQuickAccessButton : QuickAccessMenuItem
		{
			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор по умолчанию инициализирует объект класса предустановленными значениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public LotusRibbonQuickAccessButton()
			{
				InitializeComponent();
				SetResourceReference(StyleProperty, typeof(Fluent.QuickAccessMenuItem));
			}
			#endregion

			#region ======================================= ОБРАБОТЧИКИ СОБЫТИЙ =======================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Загрузка кнопки
			/// </summary>
			/// <param name="sender">Источник события</param>
			/// <param name="args">Аргументы события</param>
			//---------------------------------------------------------------------------------------------------------
			private void OnRibbonQuickAccessButton_Loaded(object sender, RoutedEventArgs args)
			{
				if (Command != null)
				{
					var command_ui = Command as RoutedIconUICommand;
					if (command_ui != null)
					{
						IsChecked = true;
					}
				}
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/**@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================
